import StrongShock.Basic

namespace StrongShock

set_option maxHeartbeats 4000000
set_option linter.unusedSimpArgs false
set_option maxRecDepth 100000

lemma bridge_P1hi (g k τ s : ℝ) (hg : 0 < g) (hn : 0 < 1 + g * k) (ht : 0 < 1 + g * (1 + (k - 1) * τ)) :
    (let n := 1 + g * k; let z := 1 / (1 + g * (1 + (k - 1) * τ)); P1c g n s z - 3 / 50 * s) * ((g + 2) ^ 1 * (1 + g * k) ^ 1 * (1 + g * (1 + (k - 1) * τ)) ^ 2) =
      s * (((22:ℝ)/25) + ((-1:ℝ)/2) * s + ((1:ℝ)/5) * g + ((-1:ℝ)/4) * g * s + ((-19:ℝ)/25) * g * τ + (1:ℝ) * g * τ * s + ((22:ℝ)/25) * g * k + ((-1:ℝ)/2) * g * k * s + ((19:ℝ)/25) * g * k * τ + (-1:ℝ) * g * k * τ * s + ((-31:ℝ)/25) * g^(2:ℕ) + ((34:ℝ)/25) * g^(2:ℕ) * τ + (1:ℝ) * g^(2:ℕ) * τ * s + ((-3:ℝ)/25) * g^(2:ℕ) * τ^(2:ℕ) + (-1:ℝ) * g^(2:ℕ) * τ^(2:ℕ) * s + ((1:ℝ)/5) * g^(2:ℕ) * k + ((3:ℝ)/4) * g^(2:ℕ) * k * s + ((-53:ℝ)/25) * g^(2:ℕ) * k * τ + (-1:ℝ) * g^(2:ℕ) * k * τ * s + ((6:ℝ)/25) * g^(2:ℕ) * k * τ^(2:ℕ) + (2:ℝ) * g^(2:ℕ) * k * τ^(2:ℕ) * s + ((19:ℝ)/25) * g^(2:ℕ) * k^(2:ℕ) * τ + ((-3:ℝ)/25) * g^(2:ℕ) * k^(2:ℕ) * τ^(2:ℕ) + (-1:ℝ) * g^(2:ℕ) * k^(2:ℕ) * τ^(2:ℕ) * s + ((-14:ℝ)/25) * g^(3:ℕ) + ((28:ℝ)/25) * g^(3:ℕ) * τ + ((-14:ℝ)/25) * g^(3:ℕ) * τ^(2:ℕ) + ((-37:ℝ)/50) * g^(3:ℕ) * k + (1:ℝ) * g^(3:ℕ) * k * s + ((-13:ℝ)/50) * g^(3:ℕ) * k * τ + (-1:ℝ) * g^(3:ℕ) * k * τ * s + (1:ℝ) * g^(3:ℕ) * k * τ^(2:ℕ) + ((-43:ℝ)/50) * g^(3:ℕ) * k^(2:ℕ) * τ + (1:ℝ) * g^(3:ℕ) * k^(2:ℕ) * τ * s + ((-8:ℝ)/25) * g^(3:ℕ) * k^(2:ℕ) * τ^(2:ℕ) + ((-3:ℝ)/25) * g^(3:ℕ) * k^(3:ℕ) * τ^(2:ℕ) + ((-3:ℝ)/50) * g^(4:ℕ) * k + ((3:ℝ)/25) * g^(4:ℕ) * k * τ + ((-3:ℝ)/50) * g^(4:ℕ) * k * τ^(2:ℕ) + ((-3:ℝ)/25) * g^(4:ℕ) * k^(2:ℕ) * τ + ((3:ℝ)/25) * g^(4:ℕ) * k^(2:ℕ) * τ^(2:ℕ) + ((-3:ℝ)/50) * g^(4:ℕ) * k^(3:ℕ) * τ^(2:ℕ)) := by
  simp only [calA, calB, Rc, Cc, P1c, P2c, Kc, K1c, Bc, Lc, c2S, c1S_s, c1S_z, c1S, d1S, V1S, V2S, cS, dS, Vs, As,
    fS, fZ, f0, f1, θ]
  field_simp
  ring


end StrongShock
