import StrongShock.Basic

namespace StrongShock

set_option maxHeartbeats 4000000
set_option linter.unusedSimpArgs false
set_option maxRecDepth 100000

lemma bridge_P1lo (g k τ s : ℝ) (hg : 0 < g) (hn : 0 < 1 + g * k) (ht : 0 < 1 + g * (1 + (k - 1) * τ)) :
    (let n := 1 + g * k; let z := 1 / (1 + g * (1 + (k - 1) * τ)); P1c g n s z - 3 / 32 * s) * ((g + 2) ^ 1 * (1 + g * k) ^ 1 * (1 + g * (1 + (k - 1) * τ)) ^ 2) =
      s * (((13:ℝ)/16) + ((-1:ℝ)/2) * s + ((1:ℝ)/32) * g + ((-1:ℝ)/4) * g * s + ((-5:ℝ)/8) * g * τ + (1:ℝ) * g * τ * s + ((13:ℝ)/16) * g * k + ((-1:ℝ)/2) * g * k * s + ((5:ℝ)/8) * g * k * τ + (-1:ℝ) * g * k * τ * s + ((-11:ℝ)/8) * g^(2:ℕ) + ((25:ℝ)/16) * g^(2:ℕ) * τ + (1:ℝ) * g^(2:ℕ) * τ * s + ((-3:ℝ)/16) * g^(2:ℕ) * τ^(2:ℕ) + (-1:ℝ) * g^(2:ℕ) * τ^(2:ℕ) * s + ((1:ℝ)/32) * g^(2:ℕ) * k + ((3:ℝ)/4) * g^(2:ℕ) * k * s + ((-35:ℝ)/16) * g^(2:ℕ) * k * τ + (-1:ℝ) * g^(2:ℕ) * k * τ * s + ((3:ℝ)/8) * g^(2:ℕ) * k * τ^(2:ℕ) + (2:ℝ) * g^(2:ℕ) * k * τ^(2:ℕ) * s + ((5:ℝ)/8) * g^(2:ℕ) * k^(2:ℕ) * τ + ((-3:ℝ)/16) * g^(2:ℕ) * k^(2:ℕ) * τ^(2:ℕ) + (-1:ℝ) * g^(2:ℕ) * k^(2:ℕ) * τ^(2:ℕ) * s + ((-19:ℝ)/32) * g^(3:ℕ) + ((19:ℝ)/16) * g^(3:ℕ) * τ + ((-19:ℝ)/32) * g^(3:ℕ) * τ^(2:ℕ) + ((-7:ℝ)/8) * g^(3:ℕ) * k + (1:ℝ) * g^(3:ℕ) * k * s + ((-1:ℝ)/8) * g^(3:ℕ) * k * τ + (-1:ℝ) * g^(3:ℕ) * k * τ * s + (1:ℝ) * g^(3:ℕ) * k * τ^(2:ℕ) + ((-17:ℝ)/16) * g^(3:ℕ) * k^(2:ℕ) * τ + (1:ℝ) * g^(3:ℕ) * k^(2:ℕ) * τ * s + ((-7:ℝ)/32) * g^(3:ℕ) * k^(2:ℕ) * τ^(2:ℕ) + ((-3:ℝ)/16) * g^(3:ℕ) * k^(3:ℕ) * τ^(2:ℕ) + ((-3:ℝ)/32) * g^(4:ℕ) * k + ((3:ℝ)/16) * g^(4:ℕ) * k * τ + ((-3:ℝ)/32) * g^(4:ℕ) * k * τ^(2:ℕ) + ((-3:ℝ)/16) * g^(4:ℕ) * k^(2:ℕ) * τ + ((3:ℝ)/16) * g^(4:ℕ) * k^(2:ℕ) * τ^(2:ℕ) + ((-3:ℝ)/32) * g^(4:ℕ) * k^(3:ℕ) * τ^(2:ℕ)) := by
  simp only [calA, calB, Rc, Cc, P1c, P2c, Kc, K1c, Bc, Lc, c2S, c1S_s, c1S_z, c1S, d1S, V1S, V2S, cS, dS, Vs, As,
    fS, fZ, f0, f1, θ]
  field_simp
  ring


end StrongShock
