import StrongShock.Basic

namespace StrongShock

set_option maxHeartbeats 4000000
set_option linter.unusedSimpArgs false
set_option maxRecDepth 100000

lemma bridge_Rlo (g k τ s : ℝ) (hg : 0 < g) (hn : 0 < 1 + g * k) (ht : 0 < 1 + g * (1 + (k - 1) * τ)) :
    (let n := 1 + g * k; let z := 1 / (1 + g * (1 + (k - 1) * τ)); s + Rc g n s z) * ((1 + g * k) ^ 1 * (1 + g * (1 + (k - 1) * τ)) ^ 2) =
      s * ((1:ℝ) + (4:ℝ) * g + (-1:ℝ) * g * s + (-6:ℝ) * g * τ + (2:ℝ) * g * τ^(2:ℕ) * s + (1:ℝ) * g * k + (-2:ℝ) * g * k * s + (6:ℝ) * g * k * τ + (2:ℝ) * g * k * τ * s + (-4:ℝ) * g * k * τ^(2:ℕ) * s + (-2:ℝ) * g * k^(2:ℕ) * τ * s + (2:ℝ) * g * k^(2:ℕ) * τ^(2:ℕ) * s + (3:ℝ) * g^(2:ℕ) + (-2:ℝ) * g^(2:ℕ) * s + (-8:ℝ) * g^(2:ℕ) * τ + (4:ℝ) * g^(2:ℕ) * τ * s + (5:ℝ) * g^(2:ℕ) * τ^(2:ℕ) + (-2:ℝ) * g^(2:ℕ) * τ^(2:ℕ) * s + (3:ℝ) * g^(2:ℕ) * k + (-4:ℝ) * g^(2:ℕ) * k * s + (3:ℝ) * g^(2:ℕ) * k * τ + (1:ℝ) * g^(2:ℕ) * k * τ * s + (-10:ℝ) * g^(2:ℕ) * k * τ^(2:ℕ) + (4:ℝ) * g^(2:ℕ) * k * τ^(2:ℕ) * s + (5:ℝ) * g^(2:ℕ) * k^(2:ℕ) * τ + (-5:ℝ) * g^(2:ℕ) * k^(2:ℕ) * τ * s + (5:ℝ) * g^(2:ℕ) * k^(2:ℕ) * τ^(2:ℕ) + (-2:ℝ) * g^(2:ℕ) * k^(2:ℕ) * τ^(2:ℕ) * s + ((-1:ℝ)/2) * g^(3:ℕ) * s + (1:ℝ) * g^(3:ℕ) * τ * s + ((-1:ℝ)/2) * g^(3:ℕ) * τ^(2:ℕ) * s + ((3:ℝ)/2) * g^(3:ℕ) * k + (-3:ℝ) * g^(3:ℕ) * k * s + ((-11:ℝ)/2) * g^(3:ℕ) * k * τ + (5:ℝ) * g^(3:ℕ) * k * τ * s + (4:ℝ) * g^(3:ℕ) * k * τ^(2:ℕ) + (-2:ℝ) * g^(3:ℕ) * k * τ^(2:ℕ) * s + ((11:ℝ)/2) * g^(3:ℕ) * k^(2:ℕ) * τ + (-6:ℝ) * g^(3:ℕ) * k^(2:ℕ) * τ * s + (-8:ℝ) * g^(3:ℕ) * k^(2:ℕ) * τ^(2:ℕ) + ((11:ℝ)/2) * g^(3:ℕ) * k^(2:ℕ) * τ^(2:ℕ) * s + (4:ℝ) * g^(3:ℕ) * k^(3:ℕ) * τ^(2:ℕ) + (-3:ℝ) * g^(3:ℕ) * k^(3:ℕ) * τ^(2:ℕ) * s + ((-1:ℝ)/2) * g^(4:ℕ) * k + ((-1:ℝ)/2) * g^(4:ℕ) * k * s + (1:ℝ) * g^(4:ℕ) * k * τ + (1:ℝ) * g^(4:ℕ) * k * τ * s + ((-1:ℝ)/2) * g^(4:ℕ) * k * τ^(2:ℕ) + ((-1:ℝ)/2) * g^(4:ℕ) * k * τ^(2:ℕ) * s + (-1:ℝ) * g^(4:ℕ) * k^(2:ℕ) * τ + (-1:ℝ) * g^(4:ℕ) * k^(2:ℕ) * τ * s + (1:ℝ) * g^(4:ℕ) * k^(2:ℕ) * τ^(2:ℕ) + (1:ℝ) * g^(4:ℕ) * k^(2:ℕ) * τ^(2:ℕ) * s + ((-1:ℝ)/2) * g^(4:ℕ) * k^(3:ℕ) * τ^(2:ℕ) + ((-1:ℝ)/2) * g^(4:ℕ) * k^(3:ℕ) * τ^(2:ℕ) * s) := by
  simp only [calA, calB, Rc, Cc, P1c, P2c, Kc, K1c, Bc, Lc, c2S, c1S_s, c1S_z, c1S, d1S, V1S, V2S, cS, dS, Vs, As,
    fS, fZ, f0, f1, θ]
  field_simp
  ring


end StrongShock
