import StrongShock.Basic

namespace StrongShock

set_option maxHeartbeats 4000000
set_option linter.unusedSimpArgs false
set_option maxRecDepth 100000

lemma bridge_T1 (g k τ s : ℝ) (hg : 0 < g) (hn : 0 < 1 + g * k) (ht : 0 < 1 + g * (1 + (k - 1) * τ)) :
    (let n := 1 + g * k; let z := 1 / (1 + g * (1 + (k - 1) * τ)); n * θ g - (n - 1) ^ 2 * (1 - z) ^ 2 / g ^ 2) * ((g + 2) ^ 2 * (1 + g * (1 + (k - 1) * τ)) ^ 2) =
      ((2:ℝ) + (4:ℝ) * g + (-4:ℝ) * g * τ + (2:ℝ) * g * k + (4:ℝ) * g * k * τ + (2:ℝ) * g^(2:ℕ) + (-4:ℝ) * g^(2:ℕ) * τ + (2:ℝ) * g^(2:ℕ) * τ^(2:ℕ) + (4:ℝ) * g^(2:ℕ) * k + (-4:ℝ) * g^(2:ℕ) * k * τ^(2:ℕ) + (-4:ℝ) * g^(2:ℕ) * k^(2:ℕ) + (12:ℝ) * g^(2:ℕ) * k^(2:ℕ) * τ + (-2:ℝ) * g^(2:ℕ) * k^(2:ℕ) * τ^(2:ℕ) + (-8:ℝ) * g^(2:ℕ) * k^(3:ℕ) * τ + (8:ℝ) * g^(2:ℕ) * k^(3:ℕ) * τ^(2:ℕ) + (-4:ℝ) * g^(2:ℕ) * k^(4:ℕ) * τ^(2:ℕ) + (2:ℝ) * g^(3:ℕ) * k + (-4:ℝ) * g^(3:ℕ) * k * τ + (2:ℝ) * g^(3:ℕ) * k * τ^(2:ℕ) + (-4:ℝ) * g^(3:ℕ) * k^(2:ℕ) + (12:ℝ) * g^(3:ℕ) * k^(2:ℕ) * τ + (-8:ℝ) * g^(3:ℕ) * k^(2:ℕ) * τ^(2:ℕ) + (-8:ℝ) * g^(3:ℕ) * k^(3:ℕ) * τ + (10:ℝ) * g^(3:ℕ) * k^(3:ℕ) * τ^(2:ℕ) + (-4:ℝ) * g^(3:ℕ) * k^(4:ℕ) * τ^(2:ℕ) + (-1:ℝ) * g^(4:ℕ) * k^(2:ℕ) + (2:ℝ) * g^(4:ℕ) * k^(2:ℕ) * τ + (-1:ℝ) * g^(4:ℕ) * k^(2:ℕ) * τ^(2:ℕ) + (-2:ℝ) * g^(4:ℕ) * k^(3:ℕ) * τ + (2:ℝ) * g^(4:ℕ) * k^(3:ℕ) * τ^(2:ℕ) + (-1:ℝ) * g^(4:ℕ) * k^(4:ℕ) * τ^(2:ℕ)) := by
  simp only [calA, calB, Rc, Cc, P1c, P2c, Kc, K1c, Bc, Lc, c2S, c1S_s, c1S_z, c1S, d1S, V1S, V2S, cS, dS, Vs, As,
    fS, fZ, f0, f1, θ]
  field_simp
  ring


end StrongShock
