import StrongShock.Basic

namespace StrongShock

set_option maxHeartbeats 4000000
set_option maxRecDepth 100000
set_option linter.unusedVariables false

lemma bern_LP1_leaf0 (g k τ s : ℝ) (h0a : (0:ℝ) ≤ g) (h0b : g ≤ (1:ℝ)) (h3a : (0:ℝ) ≤ s) (h3b : s ≤ (1:ℝ)) :
    0 ≤ ((11:ℝ)/12) + ((-1:ℝ)/2) * s + ((29:ℝ)/24) * g + ((-3:ℝ)/4) * g * s + ((-7:ℝ)/8) * g^(2:ℕ) + ((3:ℝ)/4) * g^(2:ℕ) * s + ((-29:ℝ)/24) * g^(3:ℕ) + (1:ℝ) * g^(3:ℕ) * s + ((-1:ℝ)/24) * g^(4:ℕ) := by
  have u0 : 0 ≤ ((g - (0:ℝ)) * (1:ℝ)) := by linarith
  have w0 : 0 ≤ (((1:ℝ) - g) * (1:ℝ)) := by linarith
  have u3 : 0 ≤ ((s - (0:ℝ)) * (1:ℝ)) := by linarith
  have w3 : 0 ≤ (((1:ℝ) - s) * (1:ℝ)) := by linarith
  have e : ((11:ℝ)/12) + ((-1:ℝ)/2) * s + ((29:ℝ)/24) * g + ((-3:ℝ)/4) * g * s + ((-7:ℝ)/8) * g^(2:ℕ) + ((3:ℝ)/4) * g^(2:ℕ) * s + ((-29:ℝ)/24) * g^(3:ℕ) + (1:ℝ) * g^(3:ℕ) * s + ((-1:ℝ)/24) * g^(4:ℕ) =
      ((11:ℝ)/12) * (((1:ℝ) - g) * (1:ℝ))^(4:ℕ) * (((1:ℝ) - s) * (1:ℝ))^(1:ℕ) + ((5:ℝ)/12) * (((1:ℝ) - g) * (1:ℝ))^(4:ℕ) * ((s - (0:ℝ)) * (1:ℝ))^(1:ℕ) + ((39:ℝ)/8) * ((g - (0:ℝ)) * (1:ℝ))^(1:ℕ) * (((1:ℝ) - g) * (1:ℝ))^(3:ℕ) * (((1:ℝ) - s) * (1:ℝ))^(1:ℕ) + ((17:ℝ)/8) * ((g - (0:ℝ)) * (1:ℝ))^(1:ℕ) * (((1:ℝ) - g) * (1:ℝ))^(3:ℕ) * ((s - (0:ℝ)) * (1:ℝ))^(1:ℕ) + ((33:ℝ)/4) * ((g - (0:ℝ)) * (1:ℝ))^(2:ℕ) * (((1:ℝ) - g) * (1:ℝ))^(2:ℕ) * (((1:ℝ) - s) * (1:ℝ))^(1:ℕ) + ((15:ℝ)/4) * ((g - (0:ℝ)) * (1:ℝ))^(2:ℕ) * (((1:ℝ) - g) * (1:ℝ))^(2:ℕ) * ((s - (0:ℝ)) * (1:ℝ))^(1:ℕ) + ((13:ℝ)/3) * ((g - (0:ℝ)) * (1:ℝ))^(3:ℕ) * (((1:ℝ) - g) * (1:ℝ))^(1:ℕ) * (((1:ℝ) - s) * (1:ℝ))^(1:ℕ) + ((31:ℝ)/12) * ((g - (0:ℝ)) * (1:ℝ))^(3:ℕ) * (((1:ℝ) - g) * (1:ℝ))^(1:ℕ) * ((s - (0:ℝ)) * (1:ℝ))^(1:ℕ) + ((1:ℝ)/2) * ((g - (0:ℝ)) * (1:ℝ))^(4:ℕ) * ((s - (0:ℝ)) * (1:ℝ))^(1:ℕ) := by ring
  rw [e]
  clear e
  generalize ((g - (0:ℝ)) * (1:ℝ)) = U0 at u0 ⊢
  generalize (((1:ℝ) - g) * (1:ℝ)) = W0 at w0 ⊢
  generalize ((s - (0:ℝ)) * (1:ℝ)) = U3 at u3 ⊢
  generalize (((1:ℝ) - s) * (1:ℝ)) = W3 at w3 ⊢
  positivity

lemma bern_LP1 (g k τ s : ℝ) (h0a : (0:ℝ) ≤ g) (h0b : g ≤ (1:ℝ)) (h3a : (0:ℝ) ≤ s) (h3b : s ≤ (1:ℝ)) :
    0 ≤ ((11:ℝ)/12) + ((-1:ℝ)/2) * s + ((29:ℝ)/24) * g + ((-3:ℝ)/4) * g * s + ((-7:ℝ)/8) * g^(2:ℕ) + ((3:ℝ)/4) * g^(2:ℕ) * s + ((-29:ℝ)/24) * g^(3:ℕ) + (1:ℝ) * g^(3:ℕ) * s + ((-1:ℝ)/24) * g^(4:ℕ) := by
  exact bern_LP1_leaf0 g k τ s (by linarith) (by linarith) (by linarith) (by linarith)

end StrongShock
